<?php

return [
    'withholding_rate' => 10.21,        // 源泉徴収税
    'plan_tax_rate' => 10,              // プラン登録時税込
    'tax_rate' => 10,                   // 税金徴収
    'service_fee_rate' => 10,          // サービス利用料金
    'withdrawal_rate' => 0.121,
    'tax_deduction_threshold' => 120000,
    'GMO_SHOP_ID' => env('GMO_SHOP_ID'),
    'GMO_SHOP_PASS' => env('GMO_SHOP_PASS'),
    'GMO_ENDPOINT' => env('GMO_ENDPOINT'),
    'filter_areas' => [
        [
            'class' => 'foreign',
            'label' => '海外',
            'areas' => [
                [
                    'name' => '海外',
                    'label' => '海外',
                ],
            ],
        ],
        [
            'class' => 'domestic',
            'label' => '全国',
            'areas' => [
                [
                    'name' => '全国',
                    'label' => '全国',
                ],
            ],
        ],
        [
            'class' => 'hokkaido',
            'label' => '北海道',
            'areas' => [
                [
                    'name' => '北海道',
                    'label' => '北海道',
                ],
            ],
        ],
        [
            'class' => 'northeast',
            'label' => '東北',
            'areas' => [
                [
                    'name' => '青森県',
                    'label' => '青森',
                ],
                [
                    'name' => '岩手県',
                    'label' => '岩手',
                ],
                [
                    'name' => '宮城県',
                    'label' => '宮城',
                ],
                [
                    'name' => '秋田県',
                    'label' => '秋田',
                ],
                [
                    'name' => '山形県',
                    'label' => '山形',
                ],
                [
                    'name' => '福島県',
                    'label' => '福島',
                ],
            ],
        ],
        [
            'class' => 'kanto',
            'label' => '関東',
            'areas' => [
                [
                    'name' => '茨城県',
                    'label' => '茨城',
                ],
                [
                    'name' => '栃木県',
                    'label' => '栃木',
                ],
                [
                    'name' => '群馬県',
                    'label' => '群馬',
                ],
                [
                    'name' => '埼玉県',
                    'label' => '埼玉',
                ],
                [
                    'name' => '千葉県',
                    'label' => '千葉',
                ],
                [
                    'name' => '東京都',
                    'label' => '東京',
                ],
                [
                    'name' => '神奈川県',
                    'label' => '神奈川',
                ],
            ],
        ],
        [
            'class' => 'central ',
            'label' => '中部',
            'areas' => [
                [
                    'name' => '新潟県',
                    'label' => '新潟',
                ],
                [
                    'name' => '富山県',
                    'label' => '富山',
                ],
                [
                    'name' => '石川県',
                    'label' => '石川',
                ],
                [
                    'name' => '福井県',
                    'label' => '福井',
                ],
                [
                    'name' => '山梨県',
                    'label' => '山梨',
                ],
                [
                    'name' => '長野県',
                    'label' => '長野',
                ],
                [
                    'name' => '岐阜県',
                    'label' => '岐阜',
                ],
                [
                    'name' => '静岡県',
                    'label' => '静岡',
                ],
                [
                    'name' => '愛知県',
                    'label' => '愛知',
                ],
            ],
        ],
        [
            'class' => 'kinki',
            'label' => '近畿',
            'areas' => [
                [
                    'name' => '三重県',
                    'label' => '三重',
                ],
                [
                    'name' => '滋賀県',
                    'label' => '滋賀',
                ],
                [
                    'name' => '京都府',
                    'label' => '京都',
                ],
                [
                    'name' => '大阪府',
                    'label' => '大阪',
                ],
                [
                    'name' => '兵庫県',
                    'label' => '兵庫',
                ],
                [
                    'name' => '奈良県',
                    'label' => '奈良',
                ],
                [
                    'name' => '和歌山県',
                    'label' => '和歌山',
                ],
            ],
        ],
        [
            'class' => 'chugoku',
            'label' => '中国',
            'areas' => [
                [
                    'name' => '鳥取県',
                    'label' => '鳥取',
                ],
                [
                    'name' => '島根県',
                    'label' => '島根',
                ],
                [
                    'name' => '岡山県',
                    'label' => '岡山',
                ],
                [
                    'name' => '広島県',
                    'label' => '広島',
                ],
                [
                    'name' => '山口県',
                    'label' => '山口',
                ],
            ],
        ],
        [
            'class' => 'shikoku',
            'label' => '四国',
            'areas' => [
                [
                    'name' => '徳島県',
                    'label' => '徳島',
                ],
                [
                    'name' => '香川県',
                    'label' => '香川',
                ],
                [
                    'name' => '愛媛県',
                    'label' => '愛媛',
                ],
                [
                    'name' => '高知県',
                    'label' => '高知',
                ],
            ],
        ],
        [
            'class' => 'kyushu',
            'label' => '九州',
            'areas' => [
                [
                    'name' => '福岡県',
                    'label' => '福岡',
                ],
                [
                    'name' => '佐賀県',
                    'label' => '佐賀',
                ],
                [
                    'name' => '長崎県',
                    'label' => '長崎',
                ],
                [
                    'name' => '熊本県',
                    'label' => '熊本',
                ],
                [
                    'name' => '大分県',
                    'label' => '大分',
                ],
                [
                    'name' => '宮崎県',
                    'label' => '宮崎',
                ],
                [
                    'name' => '鹿児島県',
                    'label' => '鹿児島',
                ],
                [
                    'name' => '沖縄県',
                    'label' => '沖縄',
                ],
            ],
        ],
    ],
    'area_categories' => [
        '海外',
        '全国',        
        '北海道',
        '青森県',
        '岩手県',
        '宮城県',
        '秋田県',
        '山形県',
        '福島県',
        '茨城県',
        '栃木県',
        '群馬県',
        '埼玉県',
        '千葉県',
        '東京都',
        '神奈川県',
        '新潟県',
        '富山県',
        '石川県',
        '福井県',
        '山梨県',
        '長野県',
        '岐阜県',
        '静岡県',
        '愛知県',
        '三重県',
        '滋賀県',
        '京都府',
        '大阪府',
        '兵庫県',
        '奈良県',
        '和歌山県',
        '鳥取県',
        '島根県',
        '岡山県',
        '広島県',
        '山口県',
        '徳島県',
        '香川県',
        '愛媛県',
        '高知県',
        '福岡県',
        '佐賀県',
        '長崎県',
        '熊本県',
        '大分県',
        '宮崎県',
        '鹿児島県',
        '沖縄県',
    ],
    'prefectures' => [
        '北海道',
        '青森県',
        '岩手県',
        '宮城県',
        '秋田県',
        '山形県',
        '福島県',
        '茨城県',
        '栃木県',
        '群馬県',
        '埼玉県',
        '千葉県',
        '東京都',
        '神奈川県',
        '新潟県',
        '富山県',
        '石川県',
        '福井県',
        '山梨県',
        '長野県',
        '岐阜県',
        '静岡県',
        '愛知県',
        '三重県',
        '滋賀県',
        '京都府',
        '大阪府',
        '兵庫県',
        '奈良県',
        '和歌山県',
        '鳥取県',
        '島根県',
        '岡山県',
        '広島県',
        '山口県',
        '徳島県',
        '香川県',
        '愛媛県',
        '高知県',
        '福岡県',
        '佐賀県',
        '長崎県',
        '熊本県',
        '大分県',
        '宮崎県',
        '鹿児島県',
        '沖縄県',
    ],
];